//==========================================================
//文件名称：Disp.c
//文件描述：显示控制程序
//文件版本：Ver1.0
//创建日期：2014.12.17 
//修改日期：2015.10.26 11:18
//文件作者：黄宏灵
//备注说明：无
//注意事项：无
//==========================================================
#include <string.h>
////#include <absacc.h>

//#include "TypeDefine.h"
//#include "GlobalValue.h"
//#include "Delay.h"
//#include "Lcd2002.h"
//#include "Disp.h"
#include "pbdata.h"
//==========================================================
//全局变量
u8 DispBuf[DISP_MAX_LEN];//显示缓冲区定义

//==========================================================
//函数名称：Disp_Clr
//函数功能：液晶屏清屏
//入口参数：无
//出口参数：无
//创建日期：2014.12.17
//修改日期：2014.12.17 13:52
//备注说明：清屏后地址为0
//==========================================================
void Disp_Clr( void )
{
	Lcd_Clr();	//清屏命令
}

//==========================================================
//函数名称：Disp_Char
//函数功能：显示1个字符
//入口参数：u8 ch 字符
//出口参数：无
//创建日期：2014.09.28
//修改日期：2014.09.28 13:57
//备注说明：无
//==========================================================
void Disp_Char(u8 ch)
{
	Lcd_WriteData(ch);	//显示Ascii码
}

////==========================================================
//void Disp_CharAt(u8 ch)
//{
//	Lcd_SetAddr();//设置地址
//	Lcd_WriteData(ch);	//显示Ascii码
//}

//==========================================================
//函数名称：Disp_Str
//函数功能：显示字符串
//入口参数：u8 *str 字符串首地址
//出口参数：无
//创建日期：2014.09.28
//修改日期：2014.09.28 13:59
//备注说明：无
//==========================================================
void Disp_Str(u8 *str)
{
	u8 i;
	u8 len;
	
	len=strlen((char*)str);
	if(len>LCDADDR_MAX)//最大字符判别
		len=LCDADDR_MAX;
	
	for(i=0;i<len;i++)
	{
		Lcd_WriteData(str[i]);
	}
}
//==========================================================
void Disp_StrAt(u8 *str)
{
	Lcd_SetAddr();
	Disp_Str(str);
}

//==========================================================
//函数名称：Disp_nStr
//函数功能：显示字符串前n个字符
//入口参数：无
//出口参数：无
//创建日期：2014.09.28
//修改日期：2014.09.28 14:03
//备注说明：无
//==========================================================
//void Disp_nStr(u8 *str, u8 num)
//{
//	u8 i,len;
//
//	len=strlen(str);
//	if(len>LCDADDR_MAX)//最大字符判别
//		len=LCDADDR_MAX;
//
//	if(len>num)
//		len=num;
//	for (i=0;i<len;i++)
//	{
//		Lcd_WriteData(str[i]);	//显示字符
//	}
//}

//==========================================================
//END
//==========================================================
