//==========================================================
//文件名称：Disp.h
//文件描述：显示函数头文件
//文件版本：Ver1.0
//创建日期：2014.12.17 
//修改日期：2015.10.26 11:18
//文件作者：黄宏灵
//备注说明：无
//注意事项：无
//==========================================================
#ifndef __Disp_h__
#define __Disp_h__

//==========================================================

//==========================================================
//全局变量
#define DISP_MAX_LEN (9)//显示缓冲区长度
extern u8 DispBuf[DISP_MAX_LEN];

//==========================================================
//函数声明
void Disp_Clr(void);//清屏
void Disp_Char(u8);//显示1个字符
//void Disp_CharAt(u8 ch);//地址LcdAdr显示1个字符
void Disp_Str(u8 *str);//显示字符串
void Disp_StrAt(u8 *str);//地址LcdAdr显示字符串
//void Disp_nStr(u8 *str , u8 num);//显示字符串前n个字符

#endif 
