/******************************************************************/
/* 函数名：                                                */
/* 功能：                                              */
/* 修改日期：                                                       */
/* 内容：                                                    */
/* 作者：QQ:363116119                                        */
/******************************************************************/

#include "tm1650.h"
#include "stm32f4xx_gpio.h"
#include "stm32f4xx_rcc.h"
#include "pbdata.h"
/********************************************************************/
/* 定义IIC引脚 */
#define GPIO_PORT_I2C	GPIOH		/* GPIO*/
#define TM1650_SCL_PIN		GPIO_Pin_4			/* SCL引脚号*/
#define TM1650_SDA_PIN		GPIO_Pin_5			/* SDA引脚号 */

/* 定义引脚动作*/
#define TM1650_SCL_1()  GPIO_SetBits(GPIO_PORT_I2C, TM1650_SCL_PIN)		/* SCL = 1 */
#define TM1650_SCL_0()  GPIO_ResetBits(GPIO_PORT_I2C, TM1650_SCL_PIN)		/* SCL = 0 */

#define TM1650_SDA_1()  GPIO_SetBits(GPIO_PORT_I2C, TM1650_SDA_PIN)		/* SDA = 1 */
#define TM1650_SDA_0()  GPIO_ResetBits(GPIO_PORT_I2C, TM1650_SDA_PIN)		/* SDA = 0 */

#define TM1650_SDA_READ()  GPIO_ReadInputDataBit(GPIO_PORT_I2C, TM1650_SDA_PIN)	/* 读取SDA引脚电平*/

//IO方向设置
//#define SDA_IN()  GPIO_Set(GPIOH,PIN5,GPIO_MODE_IN,GPIO_OTYPE_PP,GPIO_SPEED_50M,GPIO_PUPD_PU);//PH4/PH5设置
//#define SDA_IN()  {GPIOH->MODER&=~(3<<(5*2));GPIOH->MODER|=0<<5*2;}	//PH5输入模式
#define SDA_OUT() {GPIOH->MODER&=~(3<<(5*2));GPIOH->MODER|=1<<5*2;} //PH5输出模式

/**********************************************************************************************************
*	函数名: TM1650_GPIO_INT
*	功能: IIC引脚初始化
*	作者：
*	修改时间：
**********************************************************************************************************/
void TM1650_GPIO_INT(void)
{
//	GPIO_InitTypeDef GPIO_InitStructure;//

//	RCC_AHB1PeriphClockCmd(RCC_AHB1Periph_GPIOH, ENABLE);//

//	GPIO_InitStructure.GPIO_Pin = GPIO_Pin_4;//
//	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF;
//	
//	GPIO_InitStructure.GPIO_OType = GPIO_OType_PP;//
//	GPIO_InitStructure.GPIO_Speed =GPIO_Speed_50MHz;//
//	GPIO_Init(GPIOH, &GPIO_InitStructure);//
//	
//	GPIO_InitStructure.GPIO_Pin = GPIO_Pin_5;//
//	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF;
//	
//	GPIO_InitStructure.GPIO_OType = GPIO_OType_PP;//
//	GPIO_InitStructure.GPIO_Speed =GPIO_Speed_50MHz;//
//	GPIO_Init(GPIOH, &GPIO_InitStructure);//
//	GPIO_PinAFConfig(GPIOH, GPIO_PinSource5 , GPIO_AF9_I2C2);
	
	GPIO_InitTypeDef GPIO_InitStructure;//

	RCC_AHB1PeriphClockCmd(RCC_AHB1Periph_GPIOH, ENABLE);//

	GPIO_InitStructure.GPIO_Pin = GPIO_Pin_4|GPIO_Pin_5;//
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_OUT;
	GPIO_InitStructure.GPIO_OType = GPIO_OType_PP;//开漏输出
	GPIO_InitStructure.GPIO_Speed =GPIO_Speed_50MHz;//
	GPIO_Init(GPIOH, &GPIO_InitStructure);//
}

///**********************************************************************************************************
//*	函数名: IIC_Delay
//*	功能: 延时函数
//*	作者：
//*	修改时间：
//**********************************************************************************************************/
//static void IIc_Delay(void)
//{
//	vu8 i;
//	for (i = 0; i < 200; i++);
//}
///**********************************************************************************************************
//*	函数名: IIc_Start
//*	功能: 启动函数
//*	作者：
//*	修改时间：
//**********************************************************************************************************/
//void IIc_Start(void)
//{
//	/* 启动IIC */
//	TM1650_SCL_1();
//	TM1650_SDA_1();
//	IIc_Delay();
//	TM1650_SDA_0();
//	IIc_Delay();
//	TM1650_SCL_0();
//	IIc_Delay();
//}
///**********************************************************************************************************
//*	函数名: IIc_Stop
//*	功能: 停止函数
//*	作者：
//*	修改时间：
//**********************************************************************************************************/
//void IIc_Stop(void)
//{
//	/* 发送停止位 */
//	TM1650_SDA_0();
//	TM1650_SCL_1();
//	IIc_Delay();
//	TM1650_SDA_1();
//}
///**********************************************************************************************************
//*	函数名: IIc_SendByte
//*	功能: 发送8位数据
//*	作者：
//*	修改时间：
//**********************************************************************************************************/
//void IIc_SendByte(vu8 _ucByte)
//{
//	vu8 i;

//	/* 发送一个8位数据 */
//	for (i = 0; i < 8; i++)
//	{		
//		if (_ucByte & 0x80)
//		{
//			TM1650_SDA_1();
//		}
//		else
//		{
//			TM1650_SDA_0();
//		}
//		IIc_Delay();
//		TM1650_SCL_1();
//		IIc_Delay();	
//		TM1650_SCL_0();
//		if (i == 7)
//		{
//			 TM1650_SDA_1(); // 置高
//		}
//		_ucByte <<= 1;	/* 先送高位 */
//		IIc_Delay();
//	}
//}
///**********************************************************************************************************
//*	函数名: IIc_ReadByte
//*	功能: 接受8位数据
//*	作者：
//*	修改时间：
//**********************************************************************************************************/
//vu8 IIc_ReadByte(void)
//{
//	vu8 i;
//	vu8 value;

//	/*接受一个8位数据 */
//	value = 0;
//	for (i = 0; i < 8; i++)
//	{
//		value <<= 1;
//		TM1650_SCL_1();
//		IIc_Delay();
//		if (TM1650_SDA_READ())
//		{
//			value++;
//		}
//		TM1650_SCL_0();
//		IIc_Delay();
//	}
//	return value;
//}
///**********************************************************************************************************
//*	函数名: IIc_WaitAck
//*	功能: 等待ACK信号
//*	作者：
//*	修改时间：
//**********************************************************************************************************/
//vu8 IIc_WaitAck(void)
//{
//	vu8 re;

//	TM1650_SDA_1();	/*  */
//	IIc_Delay();
//	TM1650_SCL_1();	/*  */
//	IIc_Delay();
//	if (TM1650_SDA_READ())	/* 读取ACK */
//	{
//		re = 1;
//	}
//	else
//	{
//		re = 0;
//	}
//	TM1650_SCL_0();
//	IIc_Delay();
//	return re;
//}
///**********************************************************************************************************
//*	函数名: IIc_Ack
//*	功能: 等待ACK信号
//*	作者：
//*	修改时间：
//**********************************************************************************************************/
//void IIc_Ack(void)
//{
//	TM1650_SDA_0();	/* CPUȽ֯SDA = 0 */
//	IIc_Delay();
//	TM1650_SCL_1();	/* CPUӺʺ1ٶʱד */
//	IIc_Delay();
//	TM1650_SCL_0();
//	IIc_Delay();
//	TM1650_SDA_1();	/* CPUˍ؅SDA؜П */
//}

///**********************************************************************************************************
//*	函数名: IIc_NAck
//*	功能: 等待ACK信号
//*	作者：
//*	修改时间：
//**********************************************************************************************************/
//void IIc_NAck(void)
//{
//	TM1650_SDA_1();	/* CPUȽ֯SDA = 1 */
//	IIc_Delay();
//	TM1650_SCL_1();	/* CPUӺʺ1ٶʱד */
//	IIc_Delay();
//	TM1650_SCL_0();
//	IIc_Delay();	
//}
///**********************************************************************************************************
//*	函数名: IIc_Read_KEY
//*	功能: 读取键值
//*	作者：
//*	修改时间：
//**********************************************************************************************************/
//vu8 TM1650_Read_KEY(void)
//{
//	vu8 ucAck;
//	vu8 key;

//	IIc_Start();		/* 开始*/

//	/* 发送地址 */
//	IIc_SendByte(0x49);//读按键命令
//	ucAck = IIc_WaitAck();	/* 等待ACK*/
//	IIc_Delay();
//	key=IIc_ReadByte();//读取键值
//	IIc_Stop();			/* 读完停止 */

//	return key;
//}
///**********************************************************************************************************
//*	函数名: TM1650_SET_LED
//*	功能: 发送LED数据
//*	作者：
//*	修改时间：
//**********************************************************************************************************/
//void TM1650_SET_LED(vu8 addr,vu8 dat)
//{
//	vu8 ucAck;
//	IIc_Start();		/* 开始*/
//	IIc_SendByte(addr);
//	ucAck = IIc_WaitAck();	/* 等待ACK*/
//	IIc_SendByte(dat);
//	ucAck = IIc_WaitAck();	/* 等待ACK*/
//	IIc_Stop();			/* 读完停止 */
//}

void SDA_IN(void)
{
	GPIO_InitTypeDef GPIO_InitStructure;//

	RCC_AHB1PeriphClockCmd(RCC_AHB1Periph_GPIOH, ENABLE);//
	GPIO_InitStructure.GPIO_Pin = GPIO_Pin_5;//
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IN;
	GPIO_InitStructure.GPIO_OType = GPIO_OType_PP;//
	GPIO_InitStructure.GPIO_Speed =GPIO_Speed_50MHz;//
	GPIO_Init(GPIOH, &GPIO_InitStructure);//
}
/**********************************************************************************************************
*	函数名: IIC_Delay
*	功能: 延时函数
*	作者：
*	修改时间：
**********************************************************************************************************/
static void IIc_Delay(void)
{
	vu8 i;
	for (i = 0; i < 200; i++);
}
/**********************************************************************************************************
*	函数名: IIc_Start
*	功能: 启动函数
*	作者：
*	修改时间：
**********************************************************************************************************/
void IIc_Start(void)
{
	SDA_OUT();     //sda线输出
	/* 启动IIC */
	TM1650_SCL_1();
	TM1650_SDA_1();
	IIc_Delay();
	TM1650_SDA_0();
	IIc_Delay();
	TM1650_SCL_0();
	IIc_Delay();
}
/**********************************************************************************************************
*	函数名: IIc_Stop
*	功能: 停止函数
*	作者：
*	修改时间：
**********************************************************************************************************/
void IIc_Stop(void)
{
	SDA_OUT();     //sda线输出
	/* 发送停止位 */
	TM1650_SDA_0();
	TM1650_SCL_1();
	IIc_Delay();
	TM1650_SDA_1();
}
/**********************************************************************************************************
*	函数名: IIc_SendByte
*	功能: 发送8位数据
*	作者：
*	修改时间：
**********************************************************************************************************/
void IIc_SendByte(vu8 _ucByte)
{
	vu8 i;
	
	SDA_OUT();     //sda线输出
	TM1650_SCL_0();
	/* 发送一个8位数据 */
	for (i = 0; i < 8; i++)
	{		
		if (_ucByte & 0x80)
		{
			TM1650_SDA_1();
		}
		else
		{
			TM1650_SDA_0();
		}
		IIc_Delay();
		TM1650_SCL_1();
		IIc_Delay();	
		TM1650_SCL_0();
		if (i == 7)
		{
			 TM1650_SDA_1(); // 置高
		}
		_ucByte <<= 1;	/* 先送高位 */
		IIc_Delay();
	}
}
/**********************************************************************************************************
*	函数名: IIc_ReadByte
*	功能: 接受8位数据
*	作者：
*	修改时间：
**********************************************************************************************************/
vu8 IIc_ReadByte(void)
{
	vu8 i;
	vu8 value;

	SDA_IN();//SDA设置为输入
	/*接受一个8位数据 */
	value = 0;
	for (i = 0; i < 8; i++)
	{
		value <<= 1;
		TM1650_SCL_1();
		IIc_Delay();
		if (TM1650_SDA_READ())
		{
			value++;
		}
		TM1650_SCL_0();
		IIc_Delay();
	}
	return value;
}
/**********************************************************************************************************
*	函数名: IIc_WaitAck
*	功能: 等待ACK信号
*	作者：
*	修改时间：
**********************************************************************************************************/
vu8 IIc_WaitAck(void)
{
	vu8 re;
	TM1650_SDA_1();	/*  */
	IIc_Delay();
	TM1650_SCL_1();	/*  */
	IIc_Delay();
	
	SDA_IN();      //SDA设置为输入  
//	TM1650_SDA_1();	/*  */
//	IIc_Delay();
	TM1650_SCL_1();	/*  */
	IIc_Delay();
	if (TM1650_SDA_READ())	/* 读取ACK */
	{
		re = 1;
	}
	else
	{
		re = 0;
	}
	TM1650_SCL_0();
	IIc_Delay();
	return re;
}
/**********************************************************************************************************
*	函数名: IIc_Ack
*	功能: 等待ACK信号
*	作者：
*	修改时间：
**********************************************************************************************************/
void IIc_Ack(void)
{
	SDA_OUT();
	TM1650_SDA_0();	/* CPUȽ֯SDA = 0 */
	IIc_Delay();
	TM1650_SCL_1();	/* CPUӺʺ1ٶʱד */
	IIc_Delay();
	TM1650_SCL_0();
	IIc_Delay();
	TM1650_SDA_1();	/* CPUˍ؅SDA؜П */
	
//	TM1650_SCL_0();
//	SDA_OUT();
//	TM1650_SDA_0();
//	IIc_Delay();
//	TM1650_SCL_1();
//	IIc_Delay();
//	TM1650_SCL_0();
}

/**********************************************************************************************************
*	函数名: IIc_NAck
*	功能: 等待ACK信号
*	作者：
*	修改时间：
**********************************************************************************************************/
void IIc_NAck(void)
{
	SDA_OUT();
	TM1650_SDA_1();	/* CPUȽ֯SDA = 1 */
	IIc_Delay();
	TM1650_SCL_1();	/* CPUӺʺ1ٶʱד */
	IIc_Delay();
	TM1650_SCL_0();
	IIc_Delay();	
	
//	TM1650_SCL_0();
//	SDA_OUT();
//	TM1650_SDA_1();
//	IIc_Delay();
//	TM1650_SCL_1();
//	IIc_Delay();
//	TM1650_SCL_0();
}
/**********************************************************************************************************
*	函数名: IIc_Read_KEY
*	功能: 读取键值
*	作者：
*	修改时间：
**********************************************************************************************************/
vu8 TM1650_Read_KEY(void)
{
	vu8 ucAck;
	vu8 key;

	IIc_Start();		/* 开始*/

	/* 发送地址 */
	IIc_SendByte(0x49);//读按键命令
	ucAck = IIc_WaitAck();	/* 等待ACK*/
	IIc_Delay();
	key=IIc_ReadByte();//读取键值
	IIc_Stop();			/* 读完停止 */

	return key;
}
/**********************************************************************************************************
*	函数名: TM1650_SET_LED
*	功能: 发送LED数据
*	作者：
*	修改时间：
**********************************************************************************************************/
void TM1650_SET_LED(vu8 addr,vu8 dat)
{
	vu8 ucAck;
	IIc_Start();		/* 开始*/
	IIc_SendByte(addr);
	ucAck = IIc_WaitAck();	/* 等待ACK*/
	IIc_SendByte(dat);
	ucAck = IIc_WaitAck();	/* 等待ACK*/
	IIc_Stop();			/* 读完停止 */
}